In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../__data/salaries.csv')
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [3]:
print(df['Salary'])

0     50000
1    120000
2     80000
Name: Salary, dtype: int64

In [4]:
print(df[['Name', 'Salary']])

     Name  Salary
0    John   50000
1   Sally  120000
2  Alyssa   80000

In [5]:
print('Salary min :', df['Salary'].min())
print('Salary mean :', df['Salary'].mean())

Salary min : 50000
Salary mean : 83333.33333333333

In [6]:
ser_of_bool = df['Age'] > 30
print(ser_of_bool)

0     True
1     True
2    False
Name: Age, dtype: bool

In [7]:
df[ser_of_bool]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

In [8]:
df[df['Age'] > 30]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

In [9]:
df['Age'].unique()

array([34, 45, 27], dtype=int64)

In [10]:
df.columns

Index(['Name', 'Salary', 'Age'], dtype='object')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
Name      3 non-null object
Salary    3 non-null int64
Age       3 non-null int64
dtypes: int64(2), object(1)
memory usage: 152.0+ bytes

In [12]:
df.describe()

              Salary        Age
count       3.000000   3.000000
mean    83333.333333  35.333333
std     35118.845843   9.073772
min     50000.000000  27.000000
25%     65000.000000  30.500000
50%     80000.000000  34.000000
75%    100000.000000  39.500000
max    120000.000000  45.000000

In [13]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
import numpy as np

mat = np.arange(0, 50).reshape(5, 10)
mat

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47, 48, 49]])

In [15]:
df = pd.DataFrame(data=mat)
df

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49

In [16]:
mat = np.arange(0, 10).reshape(5, 2)
df = pd.DataFrame(data=mat)
df

   0  1
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [17]:
mat = np.arange(0, 10).reshape(5, 2)
df = pd.DataFrame(data=mat, columns=['A', 'B'])
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9